package com.ideatech.ams.system.initializer;

import com.ideatech.ams.system.dict.dao.OptionDao;
import com.ideatech.ams.system.dict.entity.OptionPo;
import com.ideatech.common.constant.DataInitializerConstant;
import com.ideatech.common.initializer.AbstractDataInitializer;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.stereotype.Component;

/**
 * @author liangding
 * @create 2018-05-28 上午9:52
 **/
@Component
public class OptionInitializer extends AbstractDataInitializer {

    @Autowired
    private OptionDao optionDao;

    @Override
    protected void doInit() throws Exception {
        createOption(1856723744L,34518957L,38,"非预算单位专用存款账户","feiyusuan");
        createOption(1259332460L,34518957L,30,"一般存款账户","yiban");
        createOption(1259332461L,34518957L,31,"基本存款账户","jiben");
        createOption(1259332462L,34518957L,32,"预算单位专用存款账户","yusuan");
        createOption(1259332463L,34518957L,33,"临时机构临时存款账户","linshi");
        createOption(1259332464L,34518957L,34,"非临时机构临时存款账户","feilinshi");
        createOption(1259332465L,34518957L,35,"特殊单位专用存款账户","teshu");

        createOption(1259332550L,34520058L,39,"正常","normal");
        createOption(1259332551L,34520058L,40,"销户","revoke");
        createOption(1259332552L,34520058L,41,"久悬","suspend");
//		createOption(1259332553L,34520058L,42,"未知","unKnow");
//		createOption(1259332554L,34520058L,43,"不存在","notExist");
        createOption(1259332555L,34520058L,44,"未激活","notActive");

        createOption(1259332556L,34520060L,45,"无需上报","buTongBu");
        createOption(1259332557L,34520060L,46,"未同步","weiTongBu");
        createOption(1259332558L,34520060L,47,"上报成功","tongBuChengGong");
        createOption(1259332559L,34520060L,48,"处理中","tongBuZhong");
        createOption(1259332560L,34520060L,49,"退回","tuiHui");
        createOption(1259332561L,34520060L,50,"上报失败","tongBuShiBai");

        createOption(2316666561L,76965711L,5,"9-其他","9");
        createOption(2451834180L,76965711L,4,"7-个体工商户","7");
        createOption(6632784953L,76965711L,0,"1-企业","1");
        createOption(8399923903L,76965711L,1,"2-事业单位","2");
        createOption(9425055805L,76965711L,3,"4-社会团体","4");
        createOption(2190126010L,76965711L,2,"3-机关","3");
        createOption(7477099102L,580885384L,1,"2-军官证","2");
        createOption(7760734985L,580885384L,0,"1-身份证","1");
        createOption(8164012697L,580885384L,4,"5-士兵证","5");
        createOption(2181291505L,580885384L,8,"8-户口簿","8");
        createOption(853269664L,580885384L,7,"9-其它合法身份证件","9");
        createOption(9796261188L,580885384L,5,"6-护照","6");
        createOption(361668288L,580885384L,2,"3-文职干部证","3");
        createOption(586023114L,580885384L,6,"7-港、澳、台居民通行证","7");
        createOption(4779565009L,580885384L,3,"4-警官证","4");
        createOption(8485508758L,801272422L,196,"审核退回","shenHeTuiHui");
        createOption(3447912819L,801272422L,83,"审核通过","shenHeTongGuo");
        createOption(1600446222L,801272422L,33,"未提交","weiTiJiao");
        createOption(378389587L,801272422L,11,"未审核","weiShenHe");
        createOption(3509270700L,801272422L,88,"审核失败","shenHeShiBai");
        createOption(7112103054L,1057945102L,162,"16-工商行政管理部门的证明","16");
        createOption(474724584L,1057945102L,12,"14-建筑主管部门核发的许可证","14");
        createOption(3867996093L,1057945102L,94,"15-施工及安装合同","15");
        createOption(6595536103L,1224598403L,0,"1-正常","1");
        createOption(9752663125L,1224598403L,2,"9-其他","9");
        createOption(2768984018L,1224598403L,1,"2-注销","2");
        createOption(5625004913L,1348184164L,1,"02-批文","02");
        createOption(823187231L,1348184164L,3,"04-开户证明","04");
        createOption(8303370101L,1348184164L,2,"03-登记证书","03");
        createOption(6784597753L,1348184164L,0,"01-工商营业执照","01");
        createOption(3448737031L,1396368840L,4,"HKD","3");
        createOption(3744489896L,1396368840L,5,"JPY","4");
        createOption(8926017757L,1396368840L,9,"AUD","C");
        createOption(9995566953L,1396368840L,10,"SGD","E");
        createOption(21351861L,1396368840L,1,"CAD","B");
        createOption(1428093000L,1396368840L,2,"KRW","D");
        createOption(3434250798L,1396368840L,3,"EUR","5");
        createOption(8215260058L,1396368840L,8,"GBP","A");
        createOption(7957383801L,1396368840L,7,"XEU","F");
        createOption(1571324249L,1396368840L,0,"CNY","1");
        createOption(6023784648L,1396368840L,6,"USD","2");
        createOption(8907267866L,1493428733L,206,"09-主管部门批文","09");
        createOption(1147864540L,1493428733L,28,"11-政府部门文件","11");
        createOption(24309670L,1493428733L,2,"10-相关部门证明","10");

        createOption(4972444568L,1908104365L,118,"存量","ACCT_INIT");
        createOption(4972444569L,1908104365L,119,"久悬","ACCT_SUSPEND");
        createOption(9471734523L,1908104365L,217,"变更","ACCT_CHANGE");
        createOption(3997035137L,1908104365L,99,"新开户","ACCT_OPEN");
        createOption(5670783424L,1908104365L,128,"销户","ACCT_REVOKE");
        createOption(5670783425L,1908104365L,129,"查询","ACCT_SEARCH");

        createOption(6780633201L,2004845588L,0,"G-工商部门","G");
        createOption(2157149592L,2004845588L,3,"B-机构编制部门","B");
        createOption(2552550715L,2004845588L,7,"Q-其他","Q");
        createOption(352138905L,2004845588L,1,"R-人民银行","R");
        createOption(8622433884L,2004845588L,4,"S-司法行政部门","S");
        createOption(9435712347L,2004845588L,5,"W-外交部门","W");
        createOption(9941756459L,2004845588L,2,"M-民政部门","M");
        createOption(4738491830L,2004845588L,6,"Z-宗教部门","Z");
        createOption(7433985801L,2192325203L,167,"待上报","weiTongBu");
        createOption(868855829L,2192325203L,21,"无需上报","buTongBu");
        createOption(9810683154L,2192325203L,224,"上报成功","tongBuChengGong");
        createOption(2143151507L,2192325203L,45,"上报失败","tongBuShiBai");
        createOption(5243102526L,2326445218L,15,"P：教育","P$$教育$$第三层次            $$5");
        createOption(1602210449L,2326445218L,3,"D：电力、煤气及水的生产和供应业","D$$电力、煤气及水的生产和供应业$$第二产业            $$2");
        createOption(5710035859L,2326445218L,13,"N：水利、环境和公共设施管理业","N$$水利、环境和公共设施管理业$$第三层次            $$5");
        createOption(5872092033L,2326445218L,14,"O：居民服务和其他服务业","O$$居民服务和其他服务业$$第三层次            $$5");
        createOption(6144297595L,2326445218L,18,"S：公共管理和社会组织","S$$公共管理和社会组织$$第四层次            $$6");
        createOption(7080273254L,2326445218L,2,"C：制造业","C$$制造业$$第二产业            $$2");
        createOption(7119981443L,2326445218L,10,"K：房地产业","K$$房地产业$$第二层次            $$4");
        createOption(8040847054L,2326445218L,9,"J：金融业","J$$金融业$$第二层次            $$4");
        createOption(8066839604L,2326445218L,1,"B：采矿业","B$$采矿业$$第二产业            $$2");
        createOption(2150254426L,2326445218L,16,"Q：卫生、社会保障和社会福利业","Q$$卫生、社会保障和社会福利业$$第三层次            $$5");
        createOption(3169680177L,2326445218L,5,"F：交通运输、仓储及邮政业","F$$交通运输、仓储及邮政业$$第一层次            $$3");
        createOption(3372805135L,2326445218L,7,"H：批发和零售业","H$$批发和零售业$$第二层次            $$4");
        createOption(3713624588L,2326445218L,6,"G：信息传输、计算机服务和软件业","G$$信息传输、计算机服务和软件业$$第二层次            $$4");
        createOption(4297251210L,2326445218L,11,"L：租赁和商务服务业","L$$租赁和商务服务业$$第二层次            $$4");
        createOption(4643759789L,2326445218L,4,"E：建筑业","E$$建筑业$$第二产业            $$2");
        createOption(8603114204L,2326445218L,0,"A：农、林、牧、渔业","A$$农、林、牧、渔业$$第一产业            $$1");
        createOption(9098227815L,2326445218L,8,"I：住宿和餐饮业","I$$住宿和餐饮业$$第二层次            $$4");
        createOption(9123596091L,2326445218L,12,"M：科学研究、技术服务和地质勘查业","M$$科学研究、技术服务和地质勘查业$$第三层次            $$5");
        createOption(9691947852L,2326445218L,19,"T：国际组织（其他行业）","T$$国际组织（其他行业）$$第四层次            $$6");
        createOption(5643988503L,2326445218L,17,"R：文化、体育和娱乐业","R$$文化、体育和娱乐业$$第三层次            $$5");
        createOption(5643988513L,2326445218L,20,"U：其他","U$$其他$$第一层次            $$3");

        createOption(5243102536L,2326445219L,15,"P：教育","P");
        createOption(5243102546L,2326445219L,3,"D：电力、煤气及水的生产和供应业","D");
        createOption(5243102556L,2326445219L,13,"N：水利、环境和公共设施管理业","N");
        createOption(5243102566L,2326445219L,14,"O：居民服务和其他服务业","O");
        createOption(5243102576L,2326445219L,18,"S：公共管理和社会组织","S");
        createOption(5243102586L,2326445219L,2,"C：制造业","C");
        createOption(5243102596L,2326445219L,10,"K：房地产业","K");
        createOption(52431025106L,2326445219L,9,"J：金融业","J");
        createOption(52431025116L,2326445219L,1,"B：采矿业","B");
        createOption(52431025126L,2326445219L,16,"Q：卫生、社会保障和社会福利业","Q");
        createOption(52431025136L,2326445219L,5,"F：交通运输、仓储及邮政业","F");
        createOption(52431025146L,2326445219L,7,"H：批发和零售业","H");
        createOption(52431025156L,2326445219L,6,"G：信息传输、计算机服务和软件业","G");
        createOption(52431025166L,2326445219L,11,"L：租赁和商务服务业","L");
        createOption(52431025176L,2326445219L,4,"E：建筑业","E");
        createOption(52431025186L,2326445219L,0,"A：农、林、牧、渔业","A");
        createOption(52431025196L,2326445219L,8,"I：住宿和餐饮业","I");
        createOption(52431025206L,2326445219L,12,"M：科学研究、技术服务和地质勘查业","M");
        createOption(52431025216L,2326445219L,19,"T：国际组织（其他行业）","T");
        createOption(52431025226L,2326445219L,17,"R：文化、体育和娱乐业","R");
        createOption(52431025326L,2326445219L,20,"U：其他","U");

        createOption(1627257257L,2483230823L,35,"06-借款合同","06");
        createOption(86734367L,2483230823L,3,"07-其他结算需要的证明","07");
        createOption(5679012375L,2621043762L,129,"6","2");
        createOption(6042784261L,2621043762L,137,"8","1");
        createOption(8445743430L,2621043762L,194,"2","3");
        createOption(2783392778L,2621043762L,67,"1","0");
        createOption(9762483458L,2621043762L,222,"3","X");
        createOption(3732722256L,2621043762L,91,"4","9");
        createOption(3938544979L,2621043762L,98,"5","4");
        createOption(4564314724L,2621043762L,109,"9","X");
        createOption(3475310670L,2621043762L,85,"7","5");
        createOption(3929251610L,3252559432L,1,"2-从事临时经营活动","2");
        createOption(5816266340L,3252559432L,0,"1-建筑施工及安装","1");
        createOption(6087118313L,3550523904L,139,"4","feilinshi");
        createOption(6613805429L,3550523904L,148,"5","teshu");
        createOption(6898838746L,3550523904L,155,"7","feiyusuan");
        createOption(2546536972L,3550523904L,59,"2","yusuan");
        createOption(2704325437L,3550523904L,63,"1","jiben");
        createOption(3190641918L,3550523904L,75,"3","linshi");
        createOption(9819426044L,3550523904L,225,"6","yiban");
        createOption(2747887092L,3703736320L,65,"1-是","1");
        createOption(9166601051L,3703736320L,212,"0-否","0");
        createOption(2747887093L,32119222946715L,0,"1","是");
        createOption(9166601052L,32119222946715L,1,"0","否");
        createOption(2220693519L,3767582583L,51,"feiyusuan","feiyusuan");
        createOption(2221928370L,3767582583L,52,"yiban","yiban");
        createOption(264964683L,3767582583L,6,"teshu","teshu");
        createOption(2814376088L,3767582583L,69,"linshi","linshi");
        createOption(3666878587L,3767582583L,89,"jiben","jiben");
        createOption(1914843338L,3767582583L,40,"feilinshi","feilinshi");
        createOption(7962569461L,3767582583L,180,"yusuan","yusuan");
        createOption(8612445522L,4148943009L,200,"09-主管部门批文","09");
        createOption(8581435111L,4148943009L,198,"01-工商营业执照","01");
        createOption(5755844756L,4396140229L,4,"05-基金会登记号","05");
        createOption(6316668509L,4396140229L,3,"04-民办非企业单位登记号","04");
        createOption(6641712285L,4396140229L,8,"99-其他","99");
        createOption(8363504016L,4396140229L,0,"01-工商注册号","01");
        createOption(173085951L,4396140229L,5,"06-宗教活动场所登记号","06");
        createOption(8494759076L,4396140229L,1,"02-机关和事业单位登记号","02");
        createOption(52010394118488L,4396140229L,7,"08-商事与非商事登记证号","08");
        createOption(78859982195899L,4396140229L,6,"07-统一社会信用代码","07");
        createOption(2170135805L,4396140229L,2,"03-社会团体登记号","03");
        createOption(7019271709L,4510851424L,159,"中华人民共和国","0");
        createOption(6073370364L,4863883672L,8,"AUD-澳大利亚元","AUD");
        createOption(6532401940L,4863883672L,3,"EUR-欧元","EUR");
        createOption(7623881657L,4863883672L,9,"CAD-加拿大元","CAD");
        createOption(2111648419L,4863883672L,4,"KRW-韩元","KRW");
        createOption(2897582802L,4863883672L,1,"USD-美元","USD");
        createOption(9512188042L,4863883672L,2,"HKD-港元","HKD");
        createOption(3921707434L,4863883672L,10,"XEU-其它货币折美元","XEU");
        createOption(4026150405L,4863883672L,6,"GBP-英镑","GBP");
        createOption(4781303434L,4863883672L,7,"SGD-新加坡元","SGD");
        createOption(9158312374L,4863883672L,5,"JPY-日元","JPY");
        createOption(3296727142L,4863883672L,0,"CNY-人民币","CNY");
//		createOption(6856976451L,4903780269L,3,"08-财政部门批复书","08");
        createOption(9255273224L,4903780269L,0,"02-批文","02");
        createOption(4833832258L,4903780269L,1,"03-登记证书","03");
        createOption(2813827106L,4903780269L,2,"04-开户证明","04");
        createOption(6856976451L,4903780269L,3,"08-财政部门批复书","08");

        createOption(9120274580L,5139679413L,3,"9-其他","9");
        createOption(1032430671L,5139679413L,2,"3-注销","3");
        createOption(9870778972L,5139679413L,1,"2-久悬","2");
        createOption(9444269347L,5139679413L,0,"1-正常","1");
        createOption(6951641022L,5352592938L,10,"11-社会保障基金","11");
        createOption(1116423968L,5352592938L,2,"03-财政预算外资金","03");
        createOption(7162866515L,5352592938L,5,"06-期货交易保证金","06");
        createOption(7395020412L,5352592938L,6,"07-金融机构存放同业资金","07");
        createOption(7749646197L,5352592938L,11,"12-收入汇缴资金","12");
        createOption(8052532972L,5352592938L,1,"02-更新改造资金","02");
        createOption(8180227317L,5352592938L,0,"01-基本建设资金","01");
        createOption(8461441711L,5352592938L,3,"04-粮、棉、油收购资金","04");
        createOption(1825751059L,5352592938L,8,"09-单位银行卡备用金","09");
        createOption(2286635101L,5352592938L,4,"05-证券交易结算资金","05");
        createOption(2706145258L,5352592938L,9,"10-住房基金","10");
        createOption(2997353575L,5352592938L,13,"14-单位内部的党、团、工会经费","14");
        createOption(9676177086L,5352592938L,14,"16-其他需要专项管理和使用的资金","16");
        createOption(879575052L,5352592938L,7,"08-政策性房地产开发资金","08");
        createOption(7107913536L,5352592938L,12,"13-业务支出资金","13");
        createOption(7524469950L,5751711480L,1,"3-中型企业","3");
        createOption(3496988279L,5751711480L,3,"5-微型企业","5");
        createOption(1658674664L,5751711480L,2,"4-小型企业","4");
        createOption(792037369L,5751711480L,0,"2-大型企业","2");
        createOption(374131779L,5751711480L,4,"9-其他","9");
        createOption(2272488639L,5877555630L,53,"ACCT_SUSPEND","ACCT_SUSPEND");
        createOption(197423215L,5877555630L,5,"ACCT_CHANGE","ACCT_CHANGE");
        createOption(4800532524L,5877555630L,114,"ACCT_OPEN","ACCT_OPEN");
        createOption(3429340817L,5877555630L,81,"ACCT_REVOKE","ACCT_REVOKE");
        createOption(5773696144L,6914306530L,4,"7-其它","7");
        createOption(6365866002L,6914306530L,3,"5-关闭","5");
        createOption(477611829L,6914306530L,5,"6-被吊销营业执照或执业许可证","6");
        createOption(2974593961L,6914306530L,0,"2-撤并","2");
        createOption(3127293240L,6914306530L,2,"4-宣告破产","4");
        createOption(1888326323L,6914306530L,1,"3-解散","3");
        createOption(7449099263L,7019913186L,0,"基本存款账户","jiben");
        createOption(7481222674L,7019913186L,5,"临时机构临时存款账户","linshi");
        createOption(7873205396L,7019913186L,6,"非临时机构临时存款账户","feilinshi");
        createOption(736026696L,7019913186L,4,"特殊单位专用存款账户","teshu");
        createOption(9871157454L,7019913186L,1,"一般存款账户","yiban");
        createOption(684370112L,7019913186L,2,"预算单位专用存款账户","yusuan");
        createOption(4497689649L,7019913186L,3,"非预算单位专用存款账户","feiyusuan");
        createOption(4497689650L,7019913186L,7,"专用存款账户","specialAcct");
        createOption(5545175176L,7713777178L,5,"06-团级(含)以上军队及分散执勤的支(分)队","06");
        createOption(1085976641L,7713777178L,11,"12-外国驻华机构","12");
        createOption(6128640045L,7713777178L,10,"11-外地常设机构","11");
        createOption(6208108221L,7713777178L,14,"15-居民委员会、村民委员会、社区委员会","15");
        createOption(6330340468L,7713777178L,8,"09-宗教组织","09");
        createOption(6999392035L,7713777178L,6,"07-团级(含)以上武警部队及分散执勤的支(分)队","07");
        createOption(1991534870L,7713777178L,16,"17-其他组织","17");
        createOption(2041736691L,7713777178L,9,"10-民办非企业组织","10");
        createOption(2302488908L,7713777178L,12,"13-有字号的个体工商户","13");
        createOption(2362291263L,7713777178L,4,"05-非预算管理的事业单位","05");
        createOption(3256347223L,7713777178L,15,"16-单位设立的独立核算的附属机构","16");
        createOption(4504943625L,7713777178L,13,"14-无字号的个体工商户","14");
        createOption(4943543090L,7713777178L,7,"08-社会团体","08");
        createOption(8642234309L,7713777178L,17,"20-境外机构","20");
        createOption(9846440857L,7713777178L,1,"02-非法人企业","02");
        createOption(298569599L,7713777178L,0,"01-企业法人","01");
        createOption(604137306L,7713777178L,3,"04-实行预算管理的事业单位","04");
        createOption(5960360079L,7713777178L,2,"03-机关","03");
        createOption(4842889337L,7959776041L,116,"1-法定代表人","1");
        createOption(5257064253L,7959776041L,122,"2-单位负责人","2");
        createOption(8864153843L,8804231399L,21,"90-其他","90");
        createOption(8892221352L,8804231399L,12,"23-港澳台独资","23");
        createOption(907089764L,8804231399L,3,"13-股份合作","13");
        createOption(1061450236L,8804231399L,9,"20-港澳台投资","20");
        createOption(2038907681L,8804231399L,7,"17-私有","17");
        createOption(2641926075L,8804231399L,20,"39-其他国外投资","39");
        createOption(3203263094L,8804231399L,6,"16-股份有限公司","16");
        createOption(3247355953L,8804231399L,8,"19-其它内资","19");
        createOption(3867328725L,8804231399L,14,"29-其他港澳台投资","29");
        createOption(3902468363L,8804231399L,2,"12-集体全资","12");
        createOption(4190453930L,8804231399L,15,"30-国外投资","30");
        createOption(4203821311L,8804231399L,16,"31-中外合资","31");
        createOption(4316675593L,8804231399L,4,"14-联营","14");
        createOption(4428252836L,8804231399L,11,"22-内地和港澳台合作","22");
        createOption(4960480814L,8804231399L,0,"10-内资","10");
        createOption(5449937740L,8804231399L,17,"33-外资","33");
        createOption(6724275686L,8804231399L,18,"32-中外合作","32");
        createOption(7249576292L,8804231399L,19,"34-国外投资股份有限公司","34");
        createOption(7570472309L,8804231399L,1,"11-国有全资","11");
        createOption(7805611056L,8804231399L,5,"15-有限责任公司","15");
        createOption(7984252414L,8804231399L,10,"21-内地和港澳台投资","21");
        createOption(8289427481L,8804231399L,13,"24-港澳台投资股份有限公司","24");
        createOption(1243165636L,8830637851L,2,"存款人名称加资金性质","2");
        createOption(4563929890L,8830637851L,1,"存款人名称加内设部门","1");
        createOption(5585239749L,8830637851L,0,"与存款人名称一致","0");
        createOption(6989389099L,8991254354L,2,"52-跨境清算","52");
        createOption(2582268115L,8991254354L,1,"51-境外贸易机构","51");
        createOption(3501971189L,8991254354L,0,"50-QFII","50");
        createOption(5082725685L,9438341854L,120,"12-证券从业资格证书","12");
        createOption(7805963377L,9438341854L,177,"17-其他","17");
        createOption(8346187596L,9693328930L,191,"08-财政部门批复书","08");
        createOption(8045856713L,9902238703L,183,"13-国家外汇管理局的批文","13");
        createOption(8738008054L,9902238703L,203,"17-其他","17");
        createOption(77955532512216L,17857276459723L,241,"ACCT_OPEN","ACCT_OPEN");
        createOption(79371685045115L,17857276459723L,243,"ACCT_REVOKE","ACCT_REVOKE");
        createOption(14212926918017L,17857276459723L,245,"ACCT_OPEN","ACCT_OPEN");
        createOption(44038058072501L,17857276459723L,244,"ACCT_REVOKE","ACCT_REVOKE");
        createOption(440380583233L,17857276459723L,244,"ACCT_REVOKE","ACCT_REVOKE");
        createOption(30703664137936L,17857276459723L,242,"ACCT_SUSPEND","ACCT_SUSPEND");
        createOption(80630026021291L,27476533824580L,385,"99","其他");
        createOption(86226500466668L,27476533824580L,382,"06","宗教活动场所登记号");
        createOption(30191367660155L,27476533824580L,378,"02","机关和事业单位登记号");
        createOption(36875126945349L,27476533824580L,381,"05","基金会登记号");
        createOption(69075023726176L,27476533824580L,383,"07","统一社会信用代码");
        createOption(57199686581748L,27476533824580L,379,"03","社会团体登记号");
        createOption(63301681840658L,27476533824580L,384,"08","商事与非商事登记证号");
        createOption(66612085528365L,27476533824580L,380,"04","民办非企业单位登记号");
        createOption(44854502659072L,27476533824580L,377,"01","工商营业执照");
        createOption(3332442L,32119222946691L,340,"02","非法人企业");
        createOption(3542441L,32119222946691L,339,"01","企业法人");
        createOption(3542440L,32119222946691L,348,"10","民办非企业组织");
        createOption(3542439L,32119222946691L,347,"09","宗教组织");
        createOption(3542438L,32119222946691L,346,"08","社会团体");
        createOption(3542437L,32119222946691L,345,"07","团级(含)以上武警部队及分散执勤的支(分)队");
        createOption(3542436L,32119222946691L,344,"06","团级(含)以上军队及分散执勤的支(分)队");
        createOption(3542435L,32119222946691L,343,"05","非预算管理的事业单位");
        createOption(3542434L,32119222946691L,342,"04","实行预算管理的事业单位");
        createOption(3542433L,32119222946691L,341,"03","机关");
        createOption(3542328L,32119222946691L,356,"20","境外机构");
        createOption(3542327L,32119222946691L,355,"17","其他组织");
        createOption(3542326L,32119222946691L,354,"16","单位设立的独立核算的附属机构");
        createOption(3542325L,32119222946691L,353,"15","居民委员会、村民委员会、社区委员会");
        createOption(3542324L,32119222946691L,352,"14","无字号的个体工商户");
        createOption(3542323L,32119222946691L,351,"13","有字号的个体工商户");
        createOption(3542321L,32119222946691L,349,"11","外地常设机构");
        createOption(3542322L,32119222946691L,350,"12","外国驻华机构");
        createOption(70598215789123L,65257890581027L,366,"AUD","澳大利亚元");
        createOption(73601094811172L,65257890581027L,375,"USD","美元");
        createOption(78265804385906L,65257890581027L,369,"EUR","欧元");
        createOption(96788051348501L,65257890581027L,373,"KRW","韩元");
        createOption(42251002238517L,65257890581027L,368,"CNY","人民币");
        createOption(28275286055758L,65257890581027L,371,"HKD","港元");
        createOption(52919147806994L,65257890581027L,374,"SGD","新加坡元");
        createOption(67635108872298L,65257890581027L,372,"JPY","日元");
        createOption(23001199680310L,65257890581027L,376,"XUE","其它货币折美元");
        createOption(26278069856679L,65257890581027L,370,"GBP","英镑");
        createOption(43199104120299L,65257890581027L,367,"CAD","加拿大元");
        createOption(82518654868437L,66157031576049L,391,"临时机构临时存款账户","linshi");
        createOption(90125533394343L,66157031576049L,392,"非临时机构临时存款账户","feilinshi");
        createOption(99530054591283L,66157031576049L,393,"未知账户性质","unknow");
        createOption(45984943768122L,66157031576049L,390,"特殊单位专用存款账户","teshu");
        createOption(20038561629507L,66157031576049L,389,"非预算单位专用存款账户","feiyusuan");
        createOption(995232148332L,66157031576049L,394,"临时账户","tempAcct");
        createOption(10757249911474L,66157031576049L,388,"预算单位专用存款账户","yusuan");
        createOption(13899112933779L,66157031576049L,386,"基本存款账户","jiben");
        createOption(17350597328234L,66157031576049L,387,"一般存款账户","yiban");
        createOption(993224598353L,66157031576049L,395,"专用账户","specialAcct");
        createOption(85278967031583L,81778761613140L,395,"3","文职干部证");
        createOption(93954172885961L,81778761613140L,357,"1","身份证");
        createOption(28721084131206L,81778761613140L,364,"9","其它合法身份证件");
        createOption(29881589176072L,81778761613140L,362,"4","警官证");
        createOption(65171412930412L,81778761613140L,360,"7","港、澳、台居民通行证");
        createOption(49763472046114L,81778761613140L,365,"8","户口簿");
        createOption(52081882052371L,81778761613140L,359,"6","护照");
        createOption(55277967031583L,81778761613140L,361,"2","军官证");
        createOption(39888889176072L,81778761613140L,396,"5","士兵证");
        createOption(81383730516531L,83463770121813L,233,"手工补录","halfSyncType");
        createOption(96753383895696L,83463770121813L,232,"自动上报","autoSyncType");
        createOption(16342745474323L,83463770121813L,240,"手工虚拟上报","sureVirtualSyncType");
        createOption(10224874547671L,83463770121813L,231,"手工上报","personSyncType");
        createOption(53838495120262L,83463770121813L,402,"线下手工上报","offLineSyncType");

        createOption(53838495120263L,32119222946693L,403,"1","法定代表人");
        createOption(53838495120264L,32119222946693L,404,"2","单位负责人");
        createOption(53838495120266L,32119222946694L,405,"07","其他结算需要的证明");
        createOption(53838495120267L,32119222946694L,406,"06","借款合同");
        createOption(53838495120268L,32119222946695L,407,"0","与存款人名称一致");
        createOption(53838495120269L,32119222946695L,408,"1","存款人名称加内设部门");
        createOption(53838495120270L,32119222946695L,409,"2","存款人名称加资金性质");
        createOption(53838495120271L,32119222946696L,410,"10","相关部门证明");
        createOption(53838495120272L,32119222946696L,411,"11","政府部门文件");
        createOption(53838495120273L,32119222946696L,412,"09","主管部门批文");
        createOption(53838495121274L,32119222946697L,413,"08","财政部门批复书");
        createOption(53838495120288L,32119222946698L,13,"14","单位内部的党、团、工会经费");
        createOption(53838495120287L,32119222946698L,14,"16","其他需要专项管理和使用的资金");
        createOption(53838495120286L,32119222946698L,12,"13","业务支出资金");
        createOption(53838495120285L,32119222946698L,11,"12","收入汇缴资金");
        createOption(53838495120284L,32119222946698L,10,"11","社会保障基金");
        createOption(53838495120283L,32119222946698L,9,"10","住房基金");
        createOption(53838495120282L,32119222946698L,8,"09","单位银行卡备用金");
        createOption(53838495120281L,32119222946698L,7,"08","政策性房地产开发资金");
        createOption(53838495120280L,32119222946698L,5,"06","期货交易保证金");
        createOption(53838495120279L,32119222946698L,6,"07","金融机构存放同业资金");
        createOption(53838495120278L,32119222946698L,4,"05","证券交易结算资金");
        createOption(53838495120277L,32119222946698L,3,"04","粮、棉、油收购资金");
        createOption(53838495120276L,32119222946698L,2,"03","财政预算外资金");
        createOption(53838495120275L,32119222946698L,1,"02","更新改造资金");
        createOption(53838495120274L,32119222946698L,0,"01","基本建设资金");
        createOption(53838495120275L,32119222946699L,0,"01","工商营业执照");
        createOption(53838495120276L,32119222946699L,1,"09","主管部门批文");
        createOption(53838495120277L,32119222946700L,0,"14","建筑主管部门核发的许可证");
        createOption(53838495120278L,32119222946700L,1,"15","施工及安装合同");
        createOption(53838495120279L,32119222946700L,2,"16","工商行政管理部门的证明");

        createOption(53838495120280L,32119222946701L,0,"01","工商营业执照");
        createOption(53838495120281L,32119222946701L,1,"02","批文");
        createOption(53838495120282L,32119222946701L,2,"03","登记证书");
        createOption(53838495120283L,32119222946701L,3,"04","开户证明");
        createOption(53838495120284L,32119222946702L,0,"02","批文");
        createOption(53838495120285L,32119222946702L,1,"03","登记证书");
        createOption(53838495120286L,32119222946702L,2,"04","开户证明");
        createOption(53838495120287L,32119222946702L,3,"08","财政部门批复书");

        createOption(53838495120288L,32119222946703L,15,"P","教育");
        createOption(53838495120289L,32119222946703L,3,"D","电力、煤气及水的生产和供应业");
        createOption(53838495120290L,32119222946703L,13,"N","水利、环境和公共设施管理业");
        createOption(53838495120291L,32119222946703L,14,"O","居民服务和其他服务业");
        createOption(53838495120292L,32119222946703L,18,"S","公共管理和社会组织");
        createOption(53838495120293L,32119222946703L,2,"C","制造业");
        createOption(53838495120294L,32119222946703L,10,"K","房地产业");
        createOption(53838495120295L,32119222946703L,9,"J","金融业");
        createOption(53838495120296L,32119222946703L,1,"B","采矿业");
        createOption(53838495120297L,32119222946703L,16,"Q","卫生、社会保障和社会福利业");
        createOption(53838495120298L,32119222946703L,5,"F","交通运输、仓储及邮政业");
        createOption(53838495120299L,32119222946703L,7,"H","批发和零售业");
        createOption(53838495120300L,32119222946703L,6,"G","信息传输、计算机服务和软件业");
        createOption(53838495120301L,32119222946703L,11,"L","租赁和商务服务业");
        createOption(53838495120302L,32119222946703L,4,"E","建筑业");
        createOption(53838495120303L,32119222946703L,0,"A","农、林、牧、渔业");
        createOption(53838495120304L,32119222946703L,8,"I","住宿和餐饮业");
        createOption(53838495120305L,32119222946703L,12,"M","科学研究、技术服务和地质勘查业");
        createOption(53838495120306L,32119222946703L,19,"T","国际组织（其他行业）");
        createOption(53838495120307L,32119222946703L,17,"R","文化、体育和娱乐业");
        createOption(53838495120418L,32119222946703L,20,"U","其他");

        createOption(53838495120308L,32119222946704L,01,"1","建筑施工及安装");
        createOption(53838495120309L,32119222946704L,02,"2","从事临时经营活动");

        createOption(53838495120310L,32119222946705L,01,"14","建筑主管部门核发的许可证");
        createOption(53838495120311L,32119222946705L,02,"15","施工及安装合同");
        createOption(53838495120312L,32119222946705L,03,"16","工商行政管理部门的证明");

        createOption(53838495120313L,32119222946706L,01,"50","QFII");
        createOption(53838495120314L,32119222946706L,02,"51","境外贸易机构");
        createOption(53838495120315L,32119222946706L,03,"52","跨境清算");

        createOption(53838495120316L,32119222946707L,01,"12","证券从业资格证书");
        createOption(53838495120317L,32119222946707L,02,"17","其他");
        createOption(53838495120318L,32119222946708L,01,"13","国家外汇管理局的批文");
        createOption(53838495120319L,32119222946708L,02,"17","其他");

        createOption(53838495120320L,32119222946709L,01,"2","大型企业");
        createOption(53838495120321L,32119222946709L,02,"3","中型企业");
        createOption(53838495120322L,32119222946709L,03,"4","小型企业");
        createOption(53838495120323L,32119222946709L,04,"5","微型企业");
        createOption(53838495120324L,32119222946709L,05,"9","其他");

        createOption(53838495120325L,32119222946710L,01,"08","政策性房地产开发资金");
        createOption(53838495120326L,32119222946710L,02,"03","财政预算外资金");
        createOption(53838495120327L,32119222946710L,03,"09","单位银行卡备用金");
        createOption(53838495120328L,32119222946710L,04,"05","证券交易结算资金");
        createOption(53838495120329L,32119222946710L,05,"10","住房基金");
        createOption(53838495120330L,32119222946710L,06,"14","单位内部的党、团、工会经费");
        createOption(53838495120331L,32119222946710L,07,"11","社会保障基金");
        createOption(53838495120332L,32119222946710L,10,"13","业务支出资金");
        createOption(53838495120333L,32119222946710L,11,"06","期货交易保证金");
        createOption(53838495120334L,32119222946710L,12,"07","金融机构存放同业资金");
        createOption(53838495120335L,32119222946710L,13,"12","收入汇缴资金");
        createOption(53838495120336L,32119222946710L,14,"02","更新改造资金");
        createOption(53838495120337L,32119222946710L,15,"01","基本建设资金");
        createOption(53838495120338L,32119222946710L,16,"04","粮、棉、油收购资金");
        createOption(53838495120339L,32119222946710L,17,"16","其他需要专项管理和使用的资金");

        createOption(53838495120340L,32119222946711L,17,"1","正常");
        createOption(53838495120341L,32119222946711L,17,"2","注销");
        createOption(53838495120342L,32119222946711L,17,"9","其他");

        createOption(53838495120343L,32119222946712L,17,"1","正常");
        createOption(53838495120344L,32119222946712L,17,"2","久悬");
        createOption(53838495120345L,32119222946712L,17,"3","其他");
        createOption(53838495120346L,32119222946712L,17,"9","其他");

        createOption(53838495120353L,32119222946722L,17,"B","机构编制部门");
        createOption(53838495120364L,32119222946722L,17,"G","工商部门");
        createOption(53838495120375L,32119222946722L,17,"M","民政部门");
        createOption(53838495120386L,32119222946722L,17,"Q","其他");
        createOption(53838495120393L,32119222946722L,17,"R","人民银行");
        createOption(53838495120444L,32119222946722L,17,"S","司法行政部门");
        createOption(53838495120545L,32119222946722L,17,"W","外交部门");
        createOption(53838495120646L,32119222946722L,17,"Z","宗教部门");

        createOption(53838495120656L,32119222946732L,17,"1","企业");
        createOption(53838495120666L,32119222946732L,17,"2","事业单位");
        createOption(53838495120676L,32119222946732L,17,"3","机关");
        createOption(53838495120686L,32119222946732L,17,"4","社会团体");
        createOption(53838495120696L,32119222946732L,17,"7","个体工商户");
        createOption(53838495120746L,32119222946732L,17,"9","其他");

        //哈尔滨 -----开始
        createOption(21000001L,40000001L,01,"","jiben");
        createOption(21000002L,40000001L,02,"","yiban");
        createOption(21000003L,40000001L,03,"","yusuan");
        createOption(21000004L,40000001L,04,"","feiyusuan");
        createOption(21000005L,40000001L,05,"","linshi");
        createOption(21000006L,40000001L,06,"","feilinshi");
        createOption(21000007L,40000001L,07,"","teshu");
        createOption(21000008L,40000001L,11,"","specialAcct");
        createOption(21000009L,40000001L,12,"","unknow");
        createOption(21000010L,40000001L,10,"","tempAcct");
        createOption(21000011L,40000001L,13,"","zengzi");
        createOption(21000012L,40000001L,14,"","yanzi");

        createOption(24000002L,40000002L,502,"","normal");
        createOption(24000003L,40000002L,501,"","revoke");
        createOption(24000004L,40000002L,503,"","suspend");
        createOption(24000005L,40000002L,504,"","unKnow");
        createOption(24000006L,40000002L,505,"","notExist");
        createOption(24000007L,40000002L,506,"","notActive");






        //存款人类别
        createOption(20000003L,40000003L,01,"01","01");
        createOption(20000004L,40000003L,02,"02","02");
        createOption(20000005L,40000003L,03,"03","08");
        createOption(20000006L,40000003L,04,"04","04");
        createOption(20000007L,40000003L,05,"05","05");
        createOption(20000008L,40000003L,06,"06","06");
        createOption(20000009L,40000003L,07,"07","07");
        createOption(20000010L,40000003L,10,"08","08");
        createOption(20000011L,40000003L,11,"09","09");
        createOption(20000012L,40000003L,12,"10","10");
        createOption(20000013L,40000003L,13,"11","11");
        createOption(20000014L,40000003L,14,"12","12");
        createOption(20000015L,40000003L,15,"13","13");
        createOption(20000016L,40000003L,16,"14","14");
        createOption(20000017L,40000003L,17,"15","15");
        createOption(20000018L,40000003L,18,"16","16");
        createOption(20000019L,40000003L,19,"17","17");
        createOption(20000020L,40000003L,20,"18","17");
        createOption(20000021L,40000003L,21,"19","17");
        createOption(20000022L,40000003L,22,"20","17");
        createOption(20000023L,40000003L,23,"99","17");
        //法人证件类型
        createOption(20000030L,40000007L,01,"01","1");
        createOption(20000031L,40000007L,02,"02","2");
        createOption(20000032L,40000007L,03,"03","8");
        createOption(20000033L,40000007L,04,"04","4");
        createOption(20000034L,40000007L,05,"05","5");
        createOption(20000035L,40000007L,06,"06","6");
        createOption(20000036L,40000007L,07,"07","7");
        createOption(20000037L,40000007L,10,"08","3");
        createOption(20000038L,40000007L,11,"09","9");
        createOption(20000039L,40000007L,12,"10","9");
        createOption(20000040L,40000007L,13,"11","1");
        createOption(20000041L,40000007L,14,"16","3");
        createOption(20000042L,40000007L,15,"24","2");
        createOption(20000043L,40000007L,16,"25","3");
        createOption(20000044L,40000007L,17,"26","9");
        createOption(20000045L,40000007L,18,"31","5");
        createOption(20000046L,40000007L,19,"32","3");
        createOption(20000047L,40000007L,20,"33","3");
        createOption(20000048L,40000007L,21,"34","2");
        createOption(20000049L,40000007L,22,"35","3");
        createOption(20000050L,40000007L,23,"36","9");
        createOption(20000051L,40000007L,24,"37","9");
        createOption(20000052L,40000007L,25,"38","7");
        createOption(20000053L,40000007L,26,"39","7");
        createOption(20000054L,40000007L,27,"40","6");
        createOption(20000055L,40000007L,28,"41","9");
        //注册币种
        createOption(20000060L,40000006L,01,"","CNY");
        createOption(20000061L,40000006L,02,"","GBP");
        createOption(20000062L,40000006L,03,"","HKD");
        createOption(20000063L,40000006L,04,"","USD");
        createOption(20000064L,40000006L,05,"","XEU");
        createOption(20000065L,40000006L,06,"","JPY");
        createOption(20000066L,40000006L,07,"","AUD");
        createOption(20000067L,40000006L,10,"","EUR");
        //证明文件种类1   jiben
        createOption(20000070L,40000008L,01,"","01");
        createOption(20000071L,40000008L,02,"","03");
        createOption(20000072L,40000008L,03,"","02");
        createOption(20000073L,40000008L,04,"","04");
//        createOption(20000074L,40000008L,05,"","08");
        //证明文件种类1  feilishi
        createOption(20000080L,40000009L,01,"","16");
        createOption(20000082L,40000009L,03,"","14");
        createOption(20000083L,40000009L,04,"","15");

        //证明文件种类1  yiban
        createOption(20000090L,40000010L,01,"","06");
        createOption(20000091L,40000010L,02,"","07");
        //证明文件种类1  linshi
        createOption(20000100L,40000011L,01,"","01");
//        createOption(20000101L,40000011L,02,"","02");
//        createOption(20000102L,40000011L,03,"","03");
//        createOption(20000103L,40000011L,04,"","04");
//        createOption(20000104L,40000011L,05,"","08");
        createOption(20000105L,40000011L,06,"","09");
        createOption(20000106L,40000011L,07,"","16");
        createOption(20000107L,40000011L,10,"","14");
        createOption(20000108L,40000011L,11,"","15");
        //开户证明文件种类1  yusuan
//        createOption(20000110L,40000012L,01,"","08");
        createOption(20000111L,40000012L,02,"","09");
        createOption(20000112L,40000012L,03,"","10");
        createOption(20000113L,40000012L,04,"","11");

        //40000013L 法人证件类型
        createOption(20000120L,40000013L,01,"","1");
        createOption(20000121L,40000013L,02,"","2");
		/*//法人身份证件种类
		createOption(20000130L,40000014L,01,"","2");
		createOption(20000131L,40000014L,02,"","1");
		createOption(20000132L,40000014L,03,"","5");
		createOption(20000133L,40000014L,04,"","8");
		createOption(20000134L,40000014L,05,"","9");
		createOption(20000135L,40000014L,06,"","6");
		createOption(20000136L,40000014L,07,"","3");
		createOption(20000137L,40000014L,10,"","7");
		createOption(20000138L,40000014L,11,"","4");*/
        //账户构成方式
        createOption(20000140L,40000017L,01,"","2");
        createOption(20000141L,40000017L,02,"","1");
        createOption(20000142L,40000017L,03,"","0");
        //上级法人40000015L
        createOption(20000150L,40000015L,01,"","1");
        createOption(20000151L,40000015L,02,"","2");
		/*//上级法人证件类型
		createOption(20000160L,40000016L,01,"","2");
		createOption(20000161L,40000016L,02,"","1");
		createOption(20000162L,40000016L,03,"","5");
		createOption(20000163L,40000016L,04,"","8");
		createOption(20000164L,40000016L,05,"","9");
		createOption(20000165L,40000016L,06,"","6");
		createOption(20000166L,40000016L,07,"","3");
		createOption(20000167L,40000016L,10,"","7");
		createOption(20000168L,40000016L,11,"","4");*/
        //资金性质
        createOption(20000170L,40000018L,10,"","11");
        createOption(20000171L,40000018L,02,"","03");
        createOption(20000172L,40000018L,05,"","06");
        createOption(20000173L,40000018L,06,"","07");
        createOption(20000174L,40000018L,11,"","12");
        createOption(20000175L,40000018L,01,"","02");
        createOption(20000176L,40000018L,15,"","01");
        createOption(20000177L,40000018L,03,"","04");
        createOption(20000178L,40000018L,8,"","09");
        createOption(20000179L,40000018L,04,"","05");
        createOption(20000180L,40000018L,9,"","10");
        createOption(20000181L,40000018L,13,"","14");
        createOption(20000182L,40000018L,14,"","16");
        createOption(20000183L,40000018L,07,"","08");
        createOption(20000184L,40000018L,12,"","13");
        //资金管理人身份证件种类40000020L
        createOption(20000200L,40000020L,01,"","2");
        createOption(20000201L,40000020L,02,"","1");
        createOption(20000202L,40000020L,03,"","5");
        createOption(20000203L,40000020L,04,"","8");
        createOption(20000204L,40000020L,05,"","9");
        createOption(20000205L,40000020L,06,"","6");
        createOption(20000206L,40000020L,07,"","3");
        createOption(20000207L,40000020L,10,"","7");
        createOption(20000208L,40000020L,11,"","4");
		/*//负责人身份证件种类40000021L
		createOption(20000210L,40000021L,01,"","2");
		createOption(20000211L,40000021L,02,"","1");
		createOption(20000212L,40000021L,03,"","5");
		createOption(20000213L,40000021L,04,"","8");
		createOption(20000214L,40000021L,05,"","9");
		createOption(20000215L,40000021L,06,"","6");
		createOption(20000216L,40000021L,07,"","3");
		createOption(20000217L,40000021L,10,"","7");
		createOption(20000218L,40000021L,11,"","4");*/
        //申请开户原因
        createOption(20000220L,40000022L,1,"","2");
        createOption(20000221L,40000022L,0,"","1");
        //建筑施工安装及实时负责人身份证件种类
        createOption(20000230L,40000023L,01,"","2");
        createOption(20000231L,40000023L,02,"","1");
        createOption(20000232L,40000023L,03,"","5");
        createOption(20000233L,40000023L,04,"","8");
        createOption(20000234L,40000023L,05,"","9");
        createOption(20000235L,40000023L,06,"","6");
        createOption(20000236L,40000023L,07,"","3");
        createOption(20000237L,40000023L,10,"","7");
        createOption(20000238L,40000023L,11,"","4");
        //登记部门
        createOption(20000240L,40000024L,0,"","G");
        createOption(20000241L,40000024L,3,"","B");
        createOption(20000242L,40000024L,7,"","Q");
        createOption(20000243L,40000024L,1,"","R");
        createOption(20000244L,40000024L,4,"","S");
        createOption(20000245L,40000024L,5,"","W");
        createOption(20000246L,40000024L,2,"","M");
        createOption(20000247L,40000024L,6,"","Z");
        //登记注册号类型
        createOption(20000250L,40000025L,4,"","05");
        createOption(20000251L,40000025L,3,"","04");
        createOption(20000252L,40000025L,8,"","99");
        createOption(20000253L,40000025L,0,"","01");
        createOption(20000254L,40000025L,5,"","06");
        createOption(20000255L,40000025L,1,"","02");
        createOption(20000256L,40000025L,7,"","08");
        createOption(20000257L,40000025L,6,"","07");
        createOption(20000258L,40000025L,2,"","03");
        //企业规模
        createOption(20000260L,40000026L,1,"","3");
        createOption(20000262L,40000026L,3,"","5");
        createOption(20000263L,40000026L,2,"","4");
        createOption(20000265L,40000026L,0,"","2");
        createOption(20000266L,40000026L,4,"","9");
        //组织机构类别
        createOption(20000270L,40000027L,5,"","9");
        createOption(20000271L,40000027L,4,"","7");
        createOption(20000272L,40000027L,0,"","1");
        createOption(20000273L,40000027L,1,"","2");
        createOption(20000274L,40000027L,3,"","4");
        createOption(20000275L,40000027L,2,"","3");
        //组织机构细分40000028L
        createOption(20000280L,40000028L,1,"","10");
        createOption(20000281L,40000028L,2,"","13");
        createOption(20000282L,40000028L,3,"","14");
        createOption(20000283L,40000028L,4,"","11");
        createOption(20000284L,40000028L,5,"","12");
        createOption(20000285L,40000028L,6,"","20");
        createOption(20000286L,40000028L,7,"","21");
        createOption(20000287L,40000028L,8,"","24");
        createOption(20000288L,40000028L,9,"","30");
        createOption(20000289L,40000028L,10,"","31");
        createOption(20000300L,40000028L,11,"","32");
        createOption(20000301L,40000028L,12,"","40");
        createOption(20000302L,40000028L,13,"","41");
        createOption(20000304L,40000028L,14,"","70");
        createOption(20000305L,40000028L,15,"","51");
        createOption(20000306L,40000028L,16,"","52");
        createOption(20000307L,40000028L,17,"","54");
        createOption(20000308L,40000028L,18,"","53");
        createOption(20000309L,40000028L,19,"","60");
        createOption(20000310L,40000028L,20,"","61");
        createOption(20000311L,40000028L,21,"","62");
        createOption(20000312L,40000028L,22,"","99");
        //经济类型
        createOption(20000400L,40000029L,21,"","90");
        createOption(20000401L,40000029L,12,"","23");
        createOption(20000402L,40000029L,3,"","13");
        createOption(20000403L,40000029L,9,"","20");
        createOption(20000404L,40000029L,7,"","17");
        createOption(20000405L,40000029L,20,"","39");
        createOption(20000406L,40000029L,6,"","16");
        createOption(20000407L,40000029L,8,"","19");
        createOption(20000408L,40000029L,14,"","29");
        createOption(20000409L,40000029L,2,"","12");
        createOption(20000410L,40000029L,15,"","30");
        createOption(20000411L,40000029L,16,"","31");
        createOption(20000412L,40000029L,4,"","14");
        createOption(20000413L,40000029L,11,"","22");
        createOption(20000414L,40000029L,0,"","10");
        createOption(20000415L,40000029L,17,"","33");
        createOption(20000416L,40000029L,18,"","32");
        createOption(20000417L,40000029L,19,"","34");
        createOption(20000418L,40000029L,1,"","11");
        createOption(20000419L,40000029L,5,"","15");
        createOption(20000420L,40000029L,10,"","21");
        createOption(20000421L,40000029L,13,"","24");
        //行业归属
        createOption(20000501L,40000004L,15,"","P$$教育$$第三层次            $$5");
        createOption(20000502L,40000004L,13,"","N$$水利、环境和公共设施管理业$$第三层次            $$5");
        createOption(20000503L,40000004L,14,"","O$$居民服务和其他服务业$$第三层次            $$5");
        createOption(20000504L,40000004L,18,"","S$$公共管理和社会组织$$第四层次            $$6");
        createOption(20000505L,40000004L,2,"","C$$制造业$$第二产业            $$2");
        createOption(20000506L,40000004L,10,"","K$$房地产业$$第二层次            $$4");
        createOption(20000507L,40000004L,9,"","J$$金融业$$第二层次            $$4");
        createOption(20000508L,40000004L,1,"","B$$采矿业$$第二产业            $$2");
        createOption(20000509L,40000004L,16,"","Q$$卫生、社会保障和社会福利业$$第三层次            $$5");
        createOption(20000510L,40000004L,5,"","F$$交通运输、仓储及邮政业$$第一层次            $$3");
        createOption(20000511L,40000004L,7,"","H$$批发和零售业$$第二层次            $$4");
        createOption(20000512L,40000004L,6,"","G$$信息传输、计算机服务和软件业$$第二层次            $$4");
        createOption(20000513L,40000004L,11,"","L$$租赁和商务服务业$$第二层次            $$4");
        createOption(20000514L,40000004L,4,"","E$$建筑业$$第二产业            $$2");
        createOption(20000515L,40000004L,0,"","A$$农、林、牧、渔业$$第一产业            $$1");
        createOption(20000516L,40000004L,8,"","I$$住宿和餐饮业$$第二层次            $$4");
        createOption(20000517L,40000004L,12,"","M$$科学研究、技术服务和地质勘查业$$第三层次            $$5");
        createOption(20000518L,40000004L,19,"","T$$国际组织（其他行业）$$第四层次            $$6");
        createOption(20000519L,40000004L,17,"","R$$文化、体育和娱乐业$$第三层次            $$5");
        createOption(20000520L,40000004L,20,"","D$$电力、煤气及水的生产和供应业$$第二产业            $$2");
        createOption(20000521L,40000004L,21,"","U$$其他$$第一层次            $$3");


        //证件种类
        createOption(20000610L,40000030L,01,"","2");
        createOption(20000611L,40000030L,02,"","1");
        createOption(20000612L,40000030L,03,"","5");
        createOption(20000613L,40000030L,04,"","8");
        createOption(20000614L,40000030L,05,"","9");
        createOption(20000615L,40000030L,06,"","6");
        createOption(20000616L,40000030L,07,"","3");
        createOption(20000617L,40000030L,10,"","7");
        createOption(20000618L,40000030L,11,"","4");

        //开户证明文件种类1  专户
//        createOption(20000710L,40000031L,01,"","08");
        createOption(20000711L,40000031L,02,"","09");
        createOption(20000712L,40000031L,03,"","10");
        createOption(20000713L,40000031L,04,"","11");
        createOption(20000714L,40000031L,05,"","12");
//        createOption(20000715L,40000031L,06,"","13");
        createOption(20000716L,40000031L,07,"","17");


        //开户证明文件种类1  非预算
        createOption(20000721L,40000032L,02,"","09");
        createOption(20000722L,40000032L,03,"","10");
        createOption(20000723L,40000032L,04,"","11");

        //开户证明文件种类1  特殊
        createOption(20000731L,40000044L,01,"","12");
        createOption(20000732L,40000044L,02,"","17");

        //数据来源
        createOption(20000910L,40000033L,01,"AMS","AMS");
        createOption(20000911L,40000033L,02,"PreBill","PreBill");
        createOption(20000912L,40000033L,03,"Core","Core");
        createOption(20000913L,40000033L,04,"Heabo","Heabo");

        //billType
        createOption(20001010L,40000034L,01,"","ACCT_INIT");
        createOption(20001011L,40000034L,02,"","ACCT_OPEN");
        createOption(20001012L,40000034L,03,"","ACCT_REVOKE");
        createOption(20001013L,40000034L,04,"","ACCT_CHANGE");
        createOption(20001014L,40000034L,05,"","ACCT_SUSPEND");
        createOption(20001015L,40000034L,06,"","ACCT_SEARCH");

        createOption(20001110L,40000005L,01,"","2");
        createOption(20001111L,40000005L,02,"","4");
        createOption(20001112L,40000005L,03,"","5");
        createOption(20001113L,40000005L,04,"","3");
        createOption(20001114L,40000005L,05,"","9");


        createOption(23000003L,40000035L,01,"","01");
        createOption(23000004L,40000035L,02,"","02");
        createOption(23000005L,40000035L,03,"","03");
        createOption(23000006L,40000035L,04,"","04");
        createOption(23000007L,40000035L,05,"","05");
        createOption(23000008L,40000035L,06,"","06");
        createOption(23000009L,40000035L,07,"","07");
        createOption(23000010L,40000035L,10,"","08");
        createOption(23000011L,40000035L,11,"","09");
        createOption(23000012L,40000035L,12,"","11");
        createOption(23000013L,40000035L,13,"","12");
        createOption(23000014L,40000035L,14,"","13");
        createOption(23000015L,40000035L,15,"","14");
        createOption(23000016L,40000035L,16,"","15");
        createOption(23000017L,40000035L,17,"","16");
        createOption(23000018L,40000035L,18,"","17");
        createOption(23000019L,40000035L,19,"","20");
        createOption(23000020L,40000035L,20,"","50");
        createOption(23000021L,40000035L,21,"","51");
        createOption(23000022L,40000035L,22,"","52");
        createOption(23000023L,40000035L,23,"","10");

        createOption(20001210L,40000036L,01,"","1");
        createOption(20001211L,40000036L,02,"","2");
        createOption(20001212L,40000036L,03,"","3");
        createOption(20001213L,40000036L,04,"","4");
        createOption(20001214L,40000036L,05,"","7");
        createOption(20001215L,40000036L,06,"","9");

        createOption(20001310L,40000037L,01,"","10");
        createOption(20001311L,40000037L,02,"","13");
        createOption(20001312L,40000037L,03,"","14");
        createOption(20001313L,40000037L,04,"","11");
        createOption(20001314L,40000037L,05,"","12");
        createOption(20001315L,40000037L,06,"","20");
        createOption(20001316L,40000037L,07,"","21");
        createOption(20001320L,40000037L,20,"","24");
        createOption(20001321L,40000037L,21,"","30");
        createOption(20001322L,40000037L,22,"","31");
        createOption(20001323L,40000037L,23,"","32");
        createOption(20001324L,40000037L,24,"","40");
        createOption(20001325L,40000037L,25,"","41");
        createOption(20001326L,40000037L,26,"","51");
        createOption(20001327L,40000037L,27,"","52");
        createOption(20001328L,40000037L,28,"","53");
        createOption(20001329L,40000037L,29,"","54");
        createOption(20001330L,40000037L,30,"","60");
        createOption(20001331L,40000037L,31,"","61");
        createOption(20001332L,40000037L,32,"","62");
        createOption(20001333L,40000037L,34,"","70");
        createOption(20001334L,40000037L,35,"","99");

        createOption(20001410L,40000038L,01,"","10");
        createOption(20001411L,40000038L,02,"","14");
        createOption(20001412L,40000038L,03,"","22");
        createOption(20001413L,40000038L,04,"","33");
        createOption(20001414L,40000038L,05,"","32");
        createOption(20001415L,40000038L,06,"","34");
        createOption(20001416L,40000038L,07,"","11");
        createOption(20001420L,40000038L,20,"","39");
        createOption(20001421L,40000038L,21,"","17");
        createOption(20001422L,40000038L,22,"","16");
        createOption(20001423L,40000038L,23,"","19");
        createOption(20001424L,40000038L,24,"","30");
        createOption(20001425L,40000038L,25,"","31");
        createOption(20001426L,40000038L,26,"","12");
        createOption(20001427L,40000038L,27,"","29");
        createOption(20001428L,40000038L,28,"","90");
        createOption(20001429L,40000038L,29,"","23");
        createOption(20001430L,40000038L,30,"","15");
        createOption(20001431L,40000038L,31,"","21");
        createOption(20001432L,40000038L,32,"","24");
        createOption(20001433L,40000038L,34,"","20");
        createOption(20001434L,40000038L,35,"","13");


        createOption(20001510L,40000039L,01,"","01");
        createOption(20001511L,40000039L,02,"","02");
        createOption(20001512L,40000039L,03,"","03");
        createOption(20001513L,40000039L,04,"","04");
        createOption(20001514L,40000039L,05,"","05");
        createOption(20001515L,40000039L,06,"","06");
        createOption(20001516L,40000039L,07,"","07");
        createOption(20001520L,40000039L,20,"","08");
        createOption(20001521L,40000039L,21,"","99");

        createOption(20001610L,40000040L,01,"","1");
        createOption(20001611L,40000040L,02,"","2");
        createOption(20001612L,40000040L,03,"","9");

        createOption(20001710L,40000041L,01,"","1");
        createOption(20001711L,40000041L,02,"","0");

        createOption(20001810L,40000042L,01,"","1");
        createOption(20001811L,40000042L,02,"","2");
        createOption(20001812L,40000042L,03,"","3");
        createOption(20001813L,40000042L,04,"","9");


        createOption(20001910L,40000043L,01,"","W");
        createOption(20001911L,40000043L,02,"","S");
        createOption(20001912L,40000043L,03,"","M");
        createOption(20001913L,40000043L,04,"","Z");
        createOption(20001914L,40000043L,05,"","G");
        createOption(20001915L,40000043L,06,"","Q");
        createOption(20001916L,40000043L,07,"","B");
        createOption(20001920L,40000043L,20,"","R");

        createOption(20002010L,40000019L,01,"","1");
        createOption(20002011L,40000019L,02,"","0");

        createOption(20002110L,40000045L,01,"","1");
        createOption(20002111L,40000045L,02,"","2");

        createOption(20002210L,40000046L,01,"","jiben");
        createOption(20002211L,40000046L,02,"","yiban");
        createOption(20002212L,40000046L,03,"","zhuanyong");
        createOption(20002213L,40000046L,04,"","linshi");
        createOption(20002214L,40000046L,05,"","unknow");

        //证明文件2--专用
        createOption(20002220L,40000047L,01,"","08");
        createOption(20002221L,40000047L,02,"","13");
        createOption(20002222L,40000047L,03,"","17");

        //证明文件2--特殊
        createOption(20002230L,40000048L,01,"","13");
        createOption(20002231L,40000048L,02,"","17");

        //证明文件2--基本
        createOption(20002240L,40000049L,01,"","02");
        createOption(20002241L,40000049L,02,"","03");
        createOption(20002242L,40000049L,03,"","04");
        createOption(20002244L,40000049L,05,"","08");

        //证明文件2--预算
        createOption(20002250L,40000050L,01,"","08");

        //证明文件2--非预算
//        createOption(20002260L,40000051L,01,"","08");

        //证明文件2--临时
        createOption(20002270L,40000052L,01,"","02");
        createOption(20002271L,40000052L,02,"","03");
        createOption(20002272L,40000052L,03,"","04");
        createOption(20002273L,40000052L,04,"","08");

        //开户证明文件1--一般
        createOption(20002280L,40000053L,01,"","06");
        createOption(20002281L,40000053L,02,"","07");

        //开户证明文件1--预算
        createOption(20002290L,40000054L,01,"","09");
        createOption(20002291L,40000054L,02,"","10");
        createOption(20002292L,40000054L,03,"","11");

        //开户证明文件1--非预算
        createOption(20002300L,40000055L,01,"","09");
        createOption(20002301L,40000055L,02,"","10");
        createOption(20002302L,40000055L,03,"","11");

        //开户证明文件1--非临时
        createOption(20002310L,40000056L,01,"","14");
        createOption(20002311L,40000056L,02,"","15");
        createOption(20002312L,40000056L,03,"","16");

        //开户证明文件1--临时
        createOption(20002320L,40000057L,01,"","14");
        createOption(20002321L,40000057L,02,"","15");
        createOption(20002322L,40000057L,03,"","16");

        //开户证明文件1--专用
        createOption(20002330L,40000058L,01,"","09");
        createOption(20002331L,40000058L,02,"","10");
        createOption(20002332L,40000058L,03,"","11");

        //开户证明文件2--预算户
        createOption(20002340L,40000060L,01,"","08");

        //开户证明文件2--专用
        createOption(20002350L,40000061L,01,"","08");

        //销户原因
        createOption(20002360L, 40000062L, 01, "", "2");
        createOption(20002361L, 40000062L, 01, "", "3");
        createOption(20002362L, 40000062L, 01, "", "4");
        createOption(20002363L, 40000062L, 01, "", "5");
        createOption(20002364L, 40000062L, 01, "", "6");
        createOption(20002365L, 40000062L, 01, "", "7");
        createOption(20002366L, 40000062L, 01, "", "1");//新增转户


        //工商电子查询接口
        createOption(10000008L,30000008L,01,"SAIC_YXKH","000000");//允许开户
        createOption(10000009L,30000008L,02,"SAIC_BYXKH","999999");//不允许开户
        createOption(10000010L,30000008L,03,"SAIC_YXKH_YC","888888");//允许开户但有提示信息

        createOption(10000011L,30000009L,01,"SAIC_WLBT","990007:网络不通");
        createOption(10000012L,30000009L,02,"SAIC_WLCS","990008:网络超时");
        createOption(10000013L,30000009L,03,"SAIC_WZYC","990009:未知异常");
        createOption(10000027L,30000009L,20,"SAIC_RegNoError","990011：工商注册号格式不正确");
//		createOption(10000014L,30000009L,04,"SAIC_NOMESSAGE","000000:无提示信息");
        createOption(10000015L,30000009L,05,"SAIC_GSDX","300000:工商状态吊销");
        createOption(10000016L,30000009L,06,"SAIC_GSZX","400000:工商状态注销");
        createOption(10000017L,30000009L,07,"SAIC_GSQC","500000:工商状态迁出");
        createOption(10000018L,30000009L,10,"SAIC_GSWF","600000:工商存在严重违法记录");
        createOption(10000018L,30000009L,12,"SAIC_JYYC","700000：工商存在经营异常记录");
        createOption(10000019L,30000009L,11,"SAIC_CXYC","120000:查询异常");
        createOption(10000020L,30000009L,13,"SAIC_CXWJG","130000：查询无结果");
        createOption(10000021L,30000009L,14,"SAIC_KeyEmpty","140000：工商验证码不能为空");
        createOption(10000022L,30000009L,15,"SAIC_RegNoEmpty","150000：工商注册号不能为空");
        createOption(10000023L,30000009L,16,"SAIC_KeyError","160000：验证码不正确");
        createOption(10000024L,30000009L,17,"SAIC_JKlocked","170000：工商接口未启用");
        createOption(10000025L,30000009L,18,"SAIC_JKError","180000：工商接口异常");
        createOption(10000026L,30000009L,19,"SAIC_TovoidDateError","190000：证件失效，证件到期日小于当天日期");
        //人行电子查询接口
        createOption(10000100L,30000010L,01,"PBC_YXKH","000000");//允许开户
        createOption(10000101L,30000010L,02,"PBC_BYXKH","999999");//不允许开户
        createOption(10000102L,30000010L,03,"PBC_YXKH_YC","888888");//允许开户但有提示信息

        createOption(22000001L,20000000L,50,"待审核","WaitCheck");
        createOption(22000002L,20000000L,51,"审核通过","CheckPass");
        createOption(22000003L,20000000L,52,"无需审核","NoCheck");

//		createOption(10000103L,30000011L,04,"PBC_NoMessage","000000:无提示信息");
        createOption(10000104L,30000011L,05,"PBC_PasswordError","990001:人行用户密码错误");
        createOption(10000105L,30000011L,06,"PBC_UserNameLock","990002:人行用户名被锁");
        createOption(10000106L,30000011L,07,"PBC_UserNameError","990003:人行 用户不存在");
        createOption(10000107L,30000011L,10,"PBC_PassWordEmpty","990004:人行用户名、密码为空");
        createOption(10000108L,30000011L,11,"PBC_MustTwoLevelRoleUser","990005:人行用户名非2级操作员");
        createOption(10000109L,30000011L,12,"PBC_LoginError","990006:人行用户登录信息失效");
        createOption(10000031L,30000011L,13,"PBC_NetNotConn","990007:网络不通");
        createOption(10000032L,30000011L,14,"PBC_NetTimeOut","990008:网络超时");
        createOption(10000033L,30000011L,15,"PBC_NetUnknow","120000:查询异常");
        createOption(10000034L,30000011L,16,"PBC_JiBenRevoke","100000:基本户已销户");
        createOption(10000035L,30000011L,17,"PBC_JibenSuspend","200000+久悬信息为XXXXXX:基本户下存在久悬户");
//		createOption(10000036L,30000011L,18,"PBC_regNoEmpty","营业执照号不能为空!");
        createOption(10000037L,30000011L,19,"PBC_accountKeyEmpty","990020：基本户开户许可证为空");
        createOption(10000038L,30000011L,20,"PBC_accountKeyError","990021：基本户开户许可证格式不正确");
        createOption(10000039L,30000011L,21,"PBC_regNoError","990022：工商注册号格式不正确");
        //人行实时接口
        createOption(10000040L,30000012L,01,"PBC_BSCG","000000");//报送成功
        createOption(10000041L,30000012L,02,"PBC_BSSB","900000");//报送失败

        createOption(10000051L,30000013L,02,"PBC_NoMessage","000000:无提示信息");
        createOption(10000052L,30000013L,03,"PBC_PasswordError","990001:人行用户密码错误");
        createOption(10000053L,30000013L,04,"PBC_UserNameLock","990002:人行用户名被锁");
        createOption(10000054L,30000013L,05,"PBC_UserNameError","990003:人行 用户不存在");
        createOption(10000055L,30000013L,06,"PBC_PassWordEmpty","990004:人行用户名、密码为空");
        createOption(10000056L,30000013L,07,"PBC_MustTwoLevelRoleUser","990005:人行用户名非2级操作员");
        createOption(10000057L,30000013L,10,"PBC_LoginError","990006:人行用户登录信息失效");
        createOption(10000058L,30000013L,11,"PBC_NetNotConn","990007:网络不通");
        createOption(10000059L,30000013L,12,"PBC_NetTimeOut","990008:网络超时");
        createOption(10000060L,30000013L,13,"PBC_NetUnknow","990009:查询异常");
        createOption(10000061L,30000013L,14,"PBC_NoSuccess","990099:不满足报备条件");
        createOption(10000062L,30000013L,15,"PBC_MessageError","990042:接口参数异常");

        //信用代码证接口
        createOption(10000070L,30000014L,01,"ECCS_BSCG","000000");//报送成功
        createOption(10000071L,30000014L,02,"ECCS_BCSB","900000");//报备失败

        createOption(10000080L,30000015L,03,"ECCS_PasswordError","990001:人行用户密码错误");
        createOption(10000081L,30000015L,04,"ECCS_UserNameLock","990002:人行用户名被锁");
        createOption(10000082L,30000015L,05,"ECCS_UserNameError","990003:人行 用户不存在");
        createOption(10000083L,30000015L,06,"ECCS_PassWordEmpty","990004:人行用户名、密码为空");
        createOption(10000084L,30000015L,07,"ECCS_MustTwoLevelRoleUser","990005:人行用户名非2级操作员");
        createOption(10000085L,30000015L,10,"ECCS_LoginError","990006:人行用户登录信息失效");
        createOption(10000086L,30000015L,11,"ECCS_NetNotConn","990007:网络不通");
        createOption(10000087L,30000015L,12,"ECCS_NetTimeOut","990008:网络超时");


        createOption(90000001L,90000000L,01,"1","开户申请书");
        createOption(90000002L,90000000L,02,"2","营业执照正本");
        createOption(90000003L,90000000L,03,"3","营业执照副本");
        createOption(90000004L,90000000L,04,"4","组织机构代码证");
        createOption(90000005L,90000000L,05,"5","单位负责人身份证件及联网核查记录");
        createOption(90000006L,90000000L,06,"6","税务登记证");

        createOption(34756447011684L,34690862699725L,532,"新建","New");
        createOption(34801584952919L,34690862699725L,537,"待补录","daiBuLu");
        createOption(34766341434790L,34690862699725L,533,"审核中","Approving");
        createOption(34775295304073L,34690862699725L,534,"审核通过","Approved");
        createOption(34784599377314L,34690862699725L,535,"驳回","Reject");
        createOption(34793493366667L,34690862699725L,536,"待核心开户","WaitingCore");


        createOption(34510012L, 34510011L, 01, "S_短期", "S");
        createOption(34510013L, 34510011L, 02, "L_长期", "L");

        createOption(34793493366668L,34690862699726L,1,"1-高管","1");
        createOption(34793493366669L,34690862699726L,2,"2-股东","2");

        createOption(34793493366670L, 34690862699727L, 1, "1-实际控制人", "1");
        createOption(34793493366671L, 34690862699727L, 2, "2-董事长", "2");
        createOption(34793493366672L, 34690862699727L, 3, "3-总经理（主要负责人）", "3");
        createOption(34793493366673L, 34690862699727L, 4, "4-财务负责人", "4");
        createOption(34793493366674L, 34690862699727L, 5, "5-监事长", "5");
        createOption(34793493366675L, 34690862699727L, 6, "6-法定代表人", "6");
        createOption(34793493366676L, 34690862699727L, 7, "7-自然人", "7");
        createOption(34793493366677L, 34690862699727L, 8, "8-机构", "8");

        createOption(63838495120301L,32119222946713L,1,"10","内资");
        createOption(63838495120302L,32119222946713L,2,"11","国有全资");
        createOption(63838495120303L,32119222946713L,3,"12","集体全资");
        createOption(63838495120304L,32119222946713L,4,"13","股份合作");
        createOption(63838495120305L,32119222946713L,5,"14","联营");
        createOption(63838495120306L,32119222946713L,6,"15","有限责任公司");
        createOption(63838495120307L,32119222946713L,7,"16","股份有限公司");
        createOption(63838495120308L,32119222946713L,8,"17","私有");
        createOption(63838495120309L,32119222946713L,9,"19","其它内资");
        createOption(63838495120310L,32119222946713L,10,"20","港澳台投资");
        createOption(63838495120311L,32119222946713L,11,"21","内地和港澳台投资");
        createOption(63838495120312L,32119222946713L,12,"22","内地和港澳台合作");
        createOption(63838495120313L,32119222946713L,13,"23","港澳台独资");
        createOption(63838495120314L,32119222946713L,14,"24","港澳台投资股份有限公司");
        createOption(63838495120315L,32119222946713L,15,"29","其他港澳台投资");
        createOption(63838495120316L,32119222946713L,16,"30","国外投资");
        createOption(63838495120317L,32119222946713L,17,"31","中外合资");
        createOption(63838495120188L,32119222946713L,18,"32","中外合作");
        createOption(63838495120319L,32119222946713L,19,"33","外资");
        createOption(63838495120320L,32119222946713L,20,"34","国外投资股份有限公司");
        createOption(63838495120321L,32119222946713L,21,"39","其他国外投资");
        createOption(63838495120322L,32119222946713L,22,"90","其他");

        createOption(73838495120320L,32119222946714L,1,"10","企业法人");
        createOption(73838495120321L,32119222946714L,2,"13","个人独资、合伙企业");
        createOption(73838495120322L,32119222946714L,3,"14","企业的分支机构");
        createOption(73838495120323L,32119222946714L,4,"11","其他企业");
        createOption(73838495120324L,32119222946714L,5,"12","农民专业合作社");
        createOption(73838495120325L,32119222946714L,6,"20","事业法人");
        createOption(73838495120326L,32119222946714L,7,"21","未登记的事业单位");
        createOption(73838495120327L,32119222946714L,8,"24","事业单位的分支机构");
        createOption(73838495120328L,32119222946714L,9,"30","机关法人");
        createOption(73838495120329L,32119222946714L,10,"31","机关的内设机构");
        createOption(73838495120330L,32119222946714L,11,"32","机关的下设机构");
        createOption(73838495120331L,32119222946714L,12,"40","社会团体法人");
        createOption(73838495120421L,32119222946714L,13,"41","社会团体分支机构");
        createOption(73838495120332L,32119222946714L,14,"51","民办非企业");
        createOption(73838495120333L,32119222946714L,15,"52","基金会");
        createOption(73838495120334L,32119222946714L,16,"53","居委会");
        createOption(73838495120335L,32119222946714L,17,"54","村委会");
        createOption(73838495120336L,32119222946714L,18,"60","律师事务所、司法鉴定所");
        createOption(73838495120337L,32119222946714L,19,"61","宗教活动场所");
        createOption(73838495120338L,32119222946714L,20,"62","境外在境内成立的组织机构");
        createOption(73838495120339L,32119222946714L,21,"70","个体工商户");
        createOption(73838495120340L,32119222946714L,21,"99","其他");

        createOption(73838495120341L,32119222946716L,1,"heabo","Heabo");

        createOption(531L,32119222946717L,46,"未设置类型","0");
        createOption(486L,32119222946717L,1,"开户申请书","1");
        createOption(487L,32119222946717L,2,"营业执照正本","2");
        createOption(488L,32119222946717L,3,"营业执照副本","3");
        createOption(489L,32119222946717L,4,"组织机构代码证","4");
        createOption(490L,32119222946717L,5,"单位负责人身份证件及联网核查记录","5");
        createOption(491L,32119222946717L,6,"税务登记证","6");
        createOption(492L,32119222946717L,7,"政府人事部门或编制委员会的批文或登记证书","7");
        createOption(493L,32119222946717L,8,"单位负责人任命文件","8");
        createOption(494L,32119222946717L,9,"财政部门同意其开户的证明","9");
        createOption(495L,32119222946717L,10,"军队单位开户核准通知书","10");
        createOption(496L,32119222946717L,11,"武警部队单位开户核准通知书","11");
        createOption(497L,32119222946717L,12,"社会团体登记证书","12");
        createOption(498L,32119222946717L,13,"宗教事务管理部门的批文和证明","13");
        createOption(499L,32119222946717L,14,"民办非企业登记证书","14");
        createOption(500L,32119222946717L,15,"外国（地区）企业常驻代表机构登记证","15");
        createOption(501L,32119222946717L,16,"外交部礼宾司出具的证明文件","16");
        createOption(503L,32119222946717L,18,"主管部门批文或证明","17");
        createOption(504L,32119222946717L,19,"隶属单位基本存款账户开户资料","18");
        createOption(505L,32119222946717L,20,"隶属单位基本存款账户开户许可证","19");
        createOption(506L,32119222946717L,21,"批文","20");
        createOption(507L,32119222946717L,22,"在境外合法注册成立的证明文件","21");
        createOption(508L,32119222946717L,23,"在境内开展相关活动所依据的法规制度或者政府主管部门的批准文件","22");
        createOption(509L,32119222946717L,24,"银行开立的审核书面声明","23");
        createOption(510L,32119222946717L,25,"特殊机构代码","24");
        createOption(511L,32119222946717L,26,"存款人身份信息证明","25");
        createOption(512L,32119222946717L,27,"政府人事部门或编制委员会的批文","26");
        createOption(513L,32119222946717L,28,"开立专用存款账户的证明文件","27");
        createOption(514L,32119222946717L,29,"临时机构设立批文","28");
        createOption(515L,32119222946717L,30,"建筑施工许可证或建筑施工及安装合同","29");
        createOption(516L,32119222946717L,31,"基本存款账户开户许可证","30");
        createOption(517L,32119222946717L,32,"项目部成立文件","31");
        createOption(518L,32119222946717L,33,"项目负责人任命文件","32");
        createOption(519L,32119222946717L,34,"项目负责人身份证件","33");
        createOption(520L,32119222946717L,35,"建筑施工及安装单位授权该项目部开户的授权书","34");
        createOption(521L,32119222946717L,36,"建筑施工企业以建筑施工企业名称后加项目部名称开立临时存款账户申请书","35");
        createOption(522L,32119222946717L,37,"变更申请书","36");
        createOption(523L,32119222946717L,38,"销户申请书","37");
        createOption(524L,32119222946717L,39,"补换发申请书","38");
        createOption(525L,32119222946717L,40,"开户许可证正本","39");
        createOption(526L,32119222946717L,41,"开户许可证副本或遗失声明","40");
        createOption(527L,32119222946717L,42,"印鉴卡-正面","41");
        createOption(528L,32119222946717L,43,"印鉴卡-反面","42");
        createOption(529L,32119222946717L,44,"其它","43");
        createOption(530L,32119222946717L,45,"未知类型","44");

        createOption(532L,32119222946718L,1,"app","1");
        createOption(533L,32119222946718L,2,"微信","2");
        createOption(534L,32119222946718L,3,"其他","3");


        createOption(634L,32119222946719L,1,"法定代表人","01");
        createOption(635L,32119222946719L,2,"财务联系人","02");
        createOption(636L,32119222946719L,3,"授权开户人","03");
        createOption(637L,32119222946719L,4,"个人开户","04");
        createOption(638L,32119222946719L,5,"其他","05");

        createOption(701L,32119222946720L,1,"2","撤并");
        createOption(702L,32119222946720L,2,"3","解散");
        createOption(703L,32119222946720L,3,"4","宣告破产");
        createOption(704L,32119222946720L,4,"5","关闭");
        createOption(705L,32119222946720L,5,"6","被吊销营业执照或执业许可证");
        createOption(706L,32119222946720L,6,"7","其它");

        createOption(707L,32119222946721L,1,"营业执照影像文件未上传","01");
        createOption(708L,32119222946721L,2,"法人证件影像文件未上传","02");
        createOption(709L,32119222946721L,3,"企业不符合账户设立标准","03");
        createOption(710L,32119222946721L,4,"其他影像资料未上传","04");
        createOption(711L,32119222946721L,5,"上传影像不清晰","05");
        createOption(716L,32119222946721L,6,"公司其他原因","06");

        createOption(712L,42119222946722L,1,"双录视频缺失","01");
        createOption(713L,42119222946722L,2,"双录视频模糊","02");
        createOption(714L,42119222946722L,3,"没有按规定回答问题","03");
        createOption(715L,42119222946722L,4,"双录视频不流畅","04");

    }

    private void createOption(Long id, Long dictId, Integer index, String name, String value) {
        if (String.valueOf(id).length() > 14) {
            id = Long.valueOf(String.valueOf(id).substring(0, 14));
        }
        if (String.valueOf(dictId).length() > 14) {
            dictId = Long.valueOf(String.valueOf(dictId).substring(0, 14));
        }
        OptionPo option = new OptionPo();
//        option.setId(id);
        if (dictId != null) {
            option.setDictionaryId(dictId);
        }
        option.setName(name);
        option.setValue(value);
        optionDao.save(option);
    }

    @Override
    protected boolean isNeedInit() {
        return optionDao.findAll().size() == 0;
    }

    @Override
    public Integer getIndex() {
        return DataInitializerConstant.OPTION_INITIALIZER_INDEX;
    }
}
